fio4pi/results/6417-4w-rpi2-raspbian_v4.1.19-v7+.log
random-write-1: (g=0): rw=randwrite, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
random-write-2: (g=0): rw=randwrite, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
random-write-3: (g=0): rw=randwrite, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
random-write-4: (g=0): rw=randwrite, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
fio-2.6
Starting 4 processes
random-write-3: Laying out IO file(s) (1 file(s) / 1024MB)
random-write-4: Laying out IO file(s) (1 file(s) / 1024MB)

random-write-1: (groupid=0, jobs=1): err= 0: pid=2953: Sun Mar 20 02:16:10 2016
  write: io=1024.0MB, bw=143626B/s, iops=35, runt=7475916msec
    clat (usec): min=29, max=11053K, avg=28496.19, stdev=159875.20
     lat (usec): min=31, max=11053K, avg=28498.31, stdev=159875.22
    clat percentiles (usec):
     |  1.00th=[   34],  5.00th=[   36], 10.00th=[   37], 20.00th=[   38],
     | 30.00th=[   39], 40.00th=[   40], 50.00th=[   41], 60.00th=[   44],
     | 70.00th=[   47], 80.00th=[   68], 90.00th=[199680], 95.00th=[199680],
     | 99.00th=[199680], 99.50th=[199680], 99.90th=[1826816], 99.95th=[3719168],
     | 99.99th=[6193152]
    bw (KB  /s): min=    0, max=29832, per=31.16%, avg=165.77, stdev=314.86
    lat (usec) : 50=72.73%, 100=12.79%, 250=2.85%, 500=0.01%, 750=0.01%
    lat (usec) : 1000=0.01%
    lat (msec) : 2=0.01%, 4=0.01%, 10=0.02%, 20=0.01%, 50=0.01%
    lat (msec) : 100=0.01%, 250=11.17%, 500=0.08%, 750=0.08%, 1000=0.05%
    lat (msec) : 2000=0.08%, >=2000=0.09%
  cpu          : usr=0.06%, sys=0.19%, ctx=31188, majf=0, minf=22
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=262144/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
random-write-2: (groupid=0, jobs=1): err= 0: pid=2954: Sun Mar 20 02:16:10 2016
  write: io=1024.0MB, bw=143868B/s, iops=35, runt=7463347msec
    clat (usec): min=30, max=11046K, avg=28448.63, stdev=159725.33
     lat (usec): min=32, max=11046K, avg=28450.77, stdev=159725.36
    clat percentiles (usec):
     |  1.00th=[   34],  5.00th=[   36], 10.00th=[   37], 20.00th=[   38],
     | 30.00th=[   39], 40.00th=[   40], 50.00th=[   41], 60.00th=[   43],
     | 70.00th=[   47], 80.00th=[   68], 90.00th=[199680], 95.00th=[199680],
     | 99.00th=[199680], 99.50th=[199680], 99.90th=[1875968], 99.95th=[3719168],
     | 99.99th=[6193152]
    bw (KB  /s): min=    0, max=40698, per=31.27%, avg=166.34, stdev=414.65
    lat (usec) : 50=73.21%, 100=12.55%, 250=2.64%, 500=0.01%, 750=0.01%
    lat (usec) : 1000=0.01%
    lat (msec) : 2=0.01%, 4=0.01%, 10=0.02%, 20=0.01%, 50=0.01%
    lat (msec) : 100=0.01%, 250=11.15%, 500=0.08%, 750=0.07%, 1000=0.05%
    lat (msec) : 2000=0.08%, >=2000=0.09%
  cpu          : usr=0.06%, sys=0.20%, ctx=31068, majf=0, minf=21
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=262144/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
random-write-3: (groupid=0, jobs=1): err= 0: pid=2955: Sun Mar 20 02:16:10 2016
  write: io=1024.0MB, bw=136383B/s, iops=33, runt=7872975msec
    clat (usec): min=23, max=10949K, avg=30010.72, stdev=183371.72
     lat (usec): min=25, max=10949K, avg=30012.91, stdev=183371.82
    clat percentiles (usec):
     |  1.00th=[   27],  5.00th=[   30], 10.00th=[   35], 20.00th=[   37],
     | 30.00th=[   39], 40.00th=[   40], 50.00th=[   42], 60.00th=[   45],
     | 70.00th=[   52], 80.00th=[  141], 90.00th=[12736], 95.00th=[199680],
     | 99.00th=[593920], 99.50th=[765952], 99.90th=[2244608], 99.95th=[3686400],
     | 99.99th=[6586368]
    bw (KB  /s): min=    0, max=70864, per=31.99%, avg=170.20, stdev=975.18
    lat (usec) : 50=68.33%, 100=9.75%, 250=4.95%, 500=0.84%, 750=0.07%
    lat (usec) : 1000=0.03%
    lat (msec) : 2=0.11%, 4=1.49%, 10=3.82%, 20=1.40%, 50=0.71%
    lat (msec) : 100=0.16%, 250=6.53%, 500=0.36%, 750=0.94%, 1000=0.17%
    lat (msec) : 2000=0.23%, >=2000=0.12%
  cpu          : usr=0.07%, sys=0.17%, ctx=55699, majf=0, minf=20
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=262144/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
random-write-4: (groupid=0, jobs=1): err= 0: pid=2956: Sun Mar 20 02:16:10 2016
  write: io=1024.0MB, bw=145143B/s, iops=35, runt=7397776msec
    clat (usec): min=23, max=11030K, avg=28197.86, stdev=163748.11
     lat (usec): min=25, max=11030K, avg=28200.01, stdev=163748.16
    clat percentiles (usec):
     |  1.00th=[   26],  5.00th=[   28], 10.00th=[   33], 20.00th=[   38],
     | 30.00th=[   40], 40.00th=[   41], 50.00th=[   43], 60.00th=[   46],
     | 70.00th=[   53], 80.00th=[  110], 90.00th=[195584], 95.00th=[199680],
     | 99.00th=[199680], 99.50th=[514048], 99.90th=[1744896], 99.95th=[3751936],
     | 99.99th=[6520832]
    bw (KB  /s): min=    0, max=76280, per=31.97%, avg=170.10, stdev=769.86
    lat (usec) : 50=67.12%, 100=11.88%, 250=4.42%, 500=0.27%, 750=0.03%
    lat (usec) : 1000=0.03%
    lat (msec) : 2=0.09%, 4=1.04%, 10=2.76%, 20=1.12%, 50=0.63%
    lat (msec) : 100=0.10%, 250=9.78%, 500=0.22%, 750=0.30%, 1000=0.04%
    lat (msec) : 2000=0.09%, >=2000=0.09%
  cpu          : usr=0.08%, sys=0.19%, ctx=50226, majf=0, minf=23
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=262144/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: io=4096.0MB, aggrb=532KB/s, minb=133KB/s, maxb=141KB/s, mint=7397776msec, maxt=7872975msec

Disk stats (read/write):
  mmcblk0: ios=36/964782, merge=0/23932, ticks=5280/496977180, in_queue=496990230, util=100.00%