fio4pi/results/6417-4w-rpi3-raspbian_v4.1.19-v7+.log
random-write-1: (g=0): rw=randwrite, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
random-write-2: (g=0): rw=randwrite, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
random-write-3: (g=0): rw=randwrite, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
random-write-4: (g=0): rw=randwrite, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
fio-2.6
Starting 4 processes
random-write-3: Laying out IO file(s) (1 file(s) / 1024MB)
random-write-4: Laying out IO file(s) (1 file(s) / 1024MB)

random-write-1: (groupid=0, jobs=1): err= 0: pid=1042: Sun Mar 20 06:37:16 2016
  write: io=1024.0MB, bw=146588B/s, iops=35, runt=7324856msec
    clat (usec): min=14, max=11969K, avg=27931.72, stdev=182097.48
     lat (usec): min=15, max=11969K, avg=27932.85, stdev=182097.50
    clat percentiles (usec):
     |  1.00th=[   17],  5.00th=[   18], 10.00th=[   19], 20.00th=[   20],
     | 30.00th=[   20], 40.00th=[   20], 50.00th=[   21], 60.00th=[   22],
     | 70.00th=[   23], 80.00th=[   29], 90.00th=[199680], 95.00th=[199680],
     | 99.00th=[199680], 99.50th=[199680], 99.90th=[1990656], 99.95th=[4358144],
     | 99.99th=[7176192]
    bw (KB  /s): min=    0, max=25979, per=32.63%, avg=176.18, stdev=287.61
    lat (usec) : 20=19.53%, 50=67.64%, 100=2.04%, 250=0.01%, 500=0.01%
    lat (usec) : 750=0.01%, 1000=0.01%
    lat (msec) : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
    lat (msec) : 100=0.01%, 250=10.33%, 500=0.08%, 750=0.08%, 1000=0.05%
    lat (msec) : 2000=0.10%, >=2000=0.10%
  cpu          : usr=0.02%, sys=0.10%, ctx=28942, majf=0, minf=22
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=262144/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
random-write-2: (groupid=0, jobs=1): err= 0: pid=1043: Sun Mar 20 06:37:16 2016
  write: io=1024.0MB, bw=146759B/s, iops=35, runt=7316328msec
    clat (usec): min=14, max=11971K, avg=27899.28, stdev=181839.53
     lat (usec): min=15, max=11971K, avg=27900.41, stdev=181839.54
    clat percentiles (usec):
     |  1.00th=[   16],  5.00th=[   18], 10.00th=[   19], 20.00th=[   19],
     | 30.00th=[   20], 40.00th=[   20], 50.00th=[   21], 60.00th=[   21],
     | 70.00th=[   23], 80.00th=[   29], 90.00th=[199680], 95.00th=[199680],
     | 99.00th=[199680], 99.50th=[199680], 99.90th=[2039808], 99.95th=[4292608],
     | 99.99th=[7176192]
    bw (KB  /s): min=    0, max=30289, per=32.69%, avg=176.50, stdev=328.32
    lat (usec) : 20=25.63%, 50=61.39%, 100=2.20%, 250=0.01%, 500=0.01%
    lat (usec) : 750=0.01%
    lat (msec) : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
    lat (msec) : 100=0.01%, 250=10.31%, 500=0.07%, 750=0.08%, 1000=0.05%
    lat (msec) : 2000=0.10%, >=2000=0.10%
  cpu          : usr=0.03%, sys=0.10%, ctx=28955, majf=0, minf=21
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=262144/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
random-write-3: (groupid=0, jobs=1): err= 0: pid=1044: Sun Mar 20 06:37:16 2016
  write: io=1024.0MB, bw=138442B/s, iops=33, runt=7755892msec
    clat (usec): min=11, max=12080K, avg=29576.21, stdev=198367.66
     lat (usec): min=12, max=12080K, avg=29577.38, stdev=198367.71
    clat percentiles (usec):
     |  1.00th=[   13],  5.00th=[   15], 10.00th=[   18], 20.00th=[   19],
     | 30.00th=[   20], 40.00th=[   20], 50.00th=[   21], 60.00th=[   22],
     | 70.00th=[   25], 80.00th=[   61], 90.00th=[11456], 95.00th=[199680],
     | 99.00th=[585728], 99.50th=[774144], 99.90th=[2408448], 99.95th=[4554752],
     | 99.99th=[7110656]
    bw (KB  /s): min=    0, max=46100, per=32.27%, avg=174.26, stdev=520.37
    lat (usec) : 20=26.10%, 50=53.06%, 100=3.69%, 250=1.22%, 500=0.09%
    lat (usec) : 750=0.05%, 1000=0.07%
    lat (msec) : 2=0.17%, 4=1.63%, 10=3.63%, 20=1.37%, 50=0.75%
    lat (msec) : 100=0.15%, 250=6.39%, 500=0.34%, 750=0.79%, 1000=0.16%
    lat (msec) : 2000=0.24%, >=2000=0.12%
  cpu          : usr=0.02%, sys=0.10%, ctx=53752, majf=0, minf=20
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=262144/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
random-write-4: (groupid=0, jobs=1): err= 0: pid=1045: Sun Mar 20 06:37:16 2016
  write: io=1024.0MB, bw=151678B/s, iops=37, runt=7079083msec
    clat (usec): min=11, max=12097K, avg=26994.56, stdev=179343.40
     lat (usec): min=12, max=12097K, avg=26995.69, stdev=179343.42
    clat percentiles (usec):
     |  1.00th=[   13],  5.00th=[   14], 10.00th=[   18], 20.00th=[   20],
     | 30.00th=[   20], 40.00th=[   21], 50.00th=[   21], 60.00th=[   23],
     | 70.00th=[   25], 80.00th=[   44], 90.00th=[28544], 95.00th=[199680],
     | 99.00th=[199680], 99.50th=[485376], 99.90th=[1925120], 99.95th=[4292608],
     | 99.99th=[6979584]
    bw (KB  /s): min=    0, max=67186, per=33.85%, avg=182.81, stdev=707.32
    lat (usec) : 20=18.49%, 50=62.16%, 100=2.87%, 250=0.34%, 500=0.05%
    lat (usec) : 750=0.04%, 1000=0.04%
    lat (msec) : 2=0.16%, 4=1.41%, 10=2.93%, 20=1.18%, 50=0.61%
    lat (msec) : 100=0.09%, 250=8.94%, 500=0.21%, 750=0.25%, 1000=0.04%
    lat (msec) : 2000=0.09%, >=2000=0.10%
  cpu          : usr=0.03%, sys=0.10%, ctx=48771, majf=0, minf=23
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=262144/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: io=4096.0MB, aggrb=540KB/s, minb=135KB/s, maxb=148KB/s, mint=7079083msec, maxt=7755892msec

Disk stats (read/write):
  mmcblk0: ios=1715/972129, merge=201/24913, ticks=261980/517489220, in_queue=517753140, util=100.00%